<?php

die();

$catalog_string = "
1 История учебного заведения
1.1 Образование техникума
1.2 Расширение структуры техникума
1.2.1 Вечерние отделения
1.2.2 Филиалы техникума
1.3 Формы обучения
1.4 Изменение подчинённости и статуса
1.5 Открытие новых специальностей
1.6 События
1.7 Встречи, юбилеи
1.8 Партнёры
1.9 Современная структура колледжа

2 Библиотека
2.1 Сотрудники
2.2 Фонды
2.3 Мероприятия

3 Повышение квалификации работников 
3.1 Начало работы КПК
3.2 Контингент КПК
3.3 Создание ЦДОУ 
3.4 Контингент ЦДОУ
3.5 Статистика подготовки
3.6 Педагогические кадры

4 Специальности 
4.01 Бурение нефтяных и газовых скважин 
4.02 Вычислительные машины, комплексы, системы и сети
4.03 Геология и разведка нефтяных и газовых месторождений 
4.04 Геофизические методы исследования скважин
4.05 Геофизические методы поисков и разведки месторождений полезных ископаемых
4.06 Компьютерные сети 
4.07 Коммерция
4.08 Контрольные измерительные и регулирующие приборы
4.09 Монтаж и техническая эксплуатация промышленного оборудования 
4.10 Приборостроение
4.11 Прикладная геодезия 
4.12 Промышленное и гражданское строительство
4.13 Разработка и эксплуатация нефтяных и газовых месторождений
4.14 Рациональное использование природохозяйственных комплексов 
4.15 Сооружение и эксплуатация газонефтепроводов и газонефтехранилищ
4.16 Техническая эксплуатация и обслуживание электрического и электромеханического оборудования (по отраслям)
4.16.1 Историческая справка*
4.16.2 Практики*
4.16.2.1 Учебные практики*
4.16.2.2 Производственные практики*
4.16.3 Выпускники*
4.16.3.01 Выпускные группы*
4.16.3.02 Отличники*
4.16.3.03 Трудоустройство*
4.16.3.03.1 Период до 1990 года*
4.16.3.03.2 Период с 1991 года*
4.16.3.03.3 Логотипы организаций*
4.16.3.04 Участники Великой Отечественной войны**
4.16.3.05 Династии*
4.16.3.06 Воины-интернационалисты**
4.16.3.07 Успешные выпускники*
4.16.3.08 Публикации о выпускниках*
4.16.3.09 Печатные издания выпускников**
4.16.3.10 Встречи с выпускниками* 

5 Коллектив
5.1 Заместители директора 
5.1.1 По учебной работе
5.1.2 По воспитательной работе 
5.1.3 По УПР
5.1.4 По АХЧ
5.2 Заведующие отделениями
5.2.1 Вечернее отделение
5.2.2 Дневное отделение
5.2.3 Заочное отделение
5.3 Преподаватели
5.3.1 Штатные преподаватели
5.3.2 Заслуженные учителя
5.3.3 Имеющие Почётные звания
5.3.4 Награждённые отраслевыми грамотами 
5.3.5 Награждённые грамотами Минобразования
5.3.6 Приватные преподаватели и совместители
5.3.7 Классные руководители
5.4 ПЦК, ПК
5.4.1 Действующие общей подготовки
5.4.1.1 Английского языка, общеобразовательных гуманитарных дисциплин
5.4.1.2 Математических, общих естественнонаучных дисциплин
5.4.1.3 Общегуманитарных и социально-экономических дисциплин
5.4.1.4 Общеобразовательных дисциплин ОПКРС
5.4.1.5 Общепрофессиональных дисциплин
5.4.1.6 Физической культуры 
5.4.1.7 Экономических дисциплин
5.4.2 Действующие выпускающие 
5.4.2.1 Геологических дисциплин
5.4.2.2 Геофизических дисциплин
5.4.2.3 Информационных дисциплин и технологий
5.4.2.4 Нефтепромысловых дисциплин
5.4.2.5 Нефтяного и машиностроительного цикла
5.4.2.6 По электротехническим профессиям и специальностям
5.4.2.7 Технического обслуживания и ремонта оборудования
5.4.2.8 Экологических дисциплин
5.4.3 Исторические
5.4.3.01 Геолого-геофизических дисциплин
5.4.3.02 Гуманитарных дисциплин
5.4.3.03 Общественно-гуманитарных дисциплин
5.4.3.04 Общетехнических дисциплин
5.4.3.05 Русского языка и литературы, истории СССР и английского языка
5.4.3.06  Русского языка и литературы, истории СССР, английского языка и военно-физической подготовки
5.4.3.07 Специальных дисциплин
5.4.3.08 Строительных дисциплин
5.4.3.09 Физики, химии, математики
5.4.3.10 Физико-математических дисциплин
5.4.3.11 Физического воспитания 
5.4.3.12 Черчения
5.5 Сотрудники
5.6 Участники Великой Отечественной войны
5.7 Труженики тыла
5.8 Выпускники – работники учебного заведения
5.9 Книга почёта

6 ИВЦ
6.1 Историческая справка
6.2 Современное состояние
6.3 Кадровый состав
6.4 Технические ресурсы

7 СМК
7.1 СМК колледжа
7.2 История создания
7.3 Служба маркетинга и качества
7.4 Персонал службы маркетинга и качества
7.5 Аудиты

8 Стипендиаты
8.1 Директорская стипендия 
8.2 Ленинская стипендия
8.3 Стипендия им. В.М.Казакова 
8.4 Стипендия им. А.Ф.Шакирова
8.5 Стипендия Правительства РФ
8.6 Стипендия Президента РБ
8.7 Стипендия Республиканской организации «Нефтегазстройпрофсоюз»
8.8 Стипендия Федерации профсоюзов РБ

9 Студенческая жизнь при социализме  
9.1 История комсомольской организации
9.1.1 Неосвобождённые секретари комитета ВЛКСМ
9.1.2 Освобождённые секретари комитета ВЛКСМ
9.1.3 Состав комитетов ВЛКСМ
9.1.4 Мероприятия с участием комсомольцев 
9.2 Студенческие летние будни
9.2.1 Работа в строительных и сельхозотрядах 
9.2.2 Работа в колхозах в осенний период

10 Методическая работа
10.1 Историческая справка
10.2 Методический кабинет
10.2.1 Методсовет
10.2.2 Учебно-методические материалы
10.2.3 Школа педагогического мастерства
10.2.4 Награды
10.3 Мероприятия 
10.3.1 Конкурсы
10.3.2 Конференции
10.3.3 Олимпиады
10.3.4 Семинары
10.3.5 Смотры
10.4 Наставники

11 Воспитательный процесс
11.1 Спортивная жизнь
11.1.1 Виды спорта
11.1.1.01 Баскетбол 
11.1.1.02 Биатлон
11.1.1.03 Борьба 
11.1.1.04 Велоспорт 
11.1.1.05 Волейбол 
11.1.1.06 Гиревой спорт
11.1.1.07 Коньки
11.1.1.08 Кросс 
11.1.1.09 Лёгкая атлетика 
11.1.1.10 Лыжи 
11.1.1.11 Многоборье военно-прикладное
11.1.1.12 Многоборье ГТО
11.1.1.12.1 Советский период
11.1.1.12.2 Период с 2016 года
11.1.1.13 Пауэрлифтинг
11.1.1.14 Плавание
11.1.1.15 Стрельба
11.1.1.16 Теннис настольный
11.1.1.17 Тяжёлая атлетика
11.1.1.18 Футбол
11.1.1.19 Шахматы
11.1.2 Награды
11.1.2.1 Вымпелы
11.1.2.2 Грамоты
11.1.2.3 Кубки
11.1.2.4 Другие награды
11.1.3 Рекорды
11.1.4 Спартакиады
11.1.5 Чемпионы
11.1.6 Учебно-материальная база
11.2 Воспитательная работа
11.2.1 Внеклассная работа
11.2.1.1 Художественная самодеятельность
11.2.1.2 Концерты
11.2.1.3 Конкурсы
11.2.1.4 Творчество студентов
11.2.1.5 Городские мероприятия
11.2.1.6 Республиканские мероприятия
11.2.2 Военно-патриотическое воспитание
11.2.3 Педагог-психолог
11.2.3.1 Конференции
11.2.3.2 Семинары
11.2.3.3 Тренинги
113.2.4 Социальный педагог
11.2.4.1 Студенческая служба безопасности
11.2.4.2 Мероприятия
11.2.5 Педагог организатор
11.2.5.1 Студенческий совет
11.2.5.2 Мероприятия
11.2.6 Жизнь в общежитиях
11.2.7 Студенческие издания
11.3 Музеи
11.3.1 Этнографический
11.3.2 Минералогический
11.3.3 Истории учебного заведения

12 Некоммерческий благотворительный фонд «Студент» 
12.1 История создания
12.2 Руководители
12.3 Бухгалтер
12.4 Благотворительность
12.5 Мероприятия

13 Учебное заведение в изданиях
14.1 Газета «Октябрьский нефтяник»
13.1.1 Период с 1952 по 1963 гг.
13.1.1.01 1952 год
13.1.1.02 1953 год
13.1.1.03 1954 год
13.1.1.04 1955 год
13.1.1.05 1956 год
13.1.1.06 1957 год
13.1.1.07 1958 год
13.1.1.08 1959 год
13.1.1.09 1960 год
13.1.1.10 1961 год
13.1.1.11 1962 год
13.1.1.12 1963 год
13.1.2 период с 1964 по 1975 гг.
13.1.2.01 1964 год
13.1.2.02 1965 год
13.1.2.03 1966 год
13.1.2.04 1967 год
13.1.2.05 1968 год
13.1.2.06 1969 год
13.1.2.07 1970 год
13.1.2.08 1971 год
13.1.2.09 1972 год
13.1.2.10 1973 год
13.1.2.11 1974 год
13.1.2.12 1975 год
13.1.3 период с 1976 по 1987 гг.
13.1.3.01 1976 год
13.1.3.02 1977 год
13.1.3.03 1978 год
13.1.3.04 1979 год
13.1.3.05 1980 год
13.1.3.06 1981 год
13.1.3.07 1982 год
13.1.3.08 1983 год 
13.1.3.09 1984 год
13.1.3.10 1985 год
13.1.3.11 1986 год
13.1.3.12 1987 год
13.1.4 Период с 1988 по 1999 гг.
13.1.4.01 1988 год
13.1.4.02 1989 год
13.1.4.03 1990 год
13.1.4.04 1991 год
13.1.4.05 1992 год
13.1.4.06 1993 год
13.1.4.07 1994 год
13.1.4.08 1995 год
13.1.4.09 1996 год
13.1.4.10 1997 год
13.1.4.11 1998 год
13.1.4.12 1999 год
13.1.5 Период с 2000 по 2011 гг.
13.1.5.01 2000 год
13.1.5.02 2001 год
13.1.5.03 2002 год
13.1.5.04 2003 год
13.1.5.05 2004 год
13.1.5.06 2005 год
13.1.5.07 2006 год
13.1.5.08 2007 год
13.1.5.09 2008 год
13.1.5.10 2009 год
13.1.5.11 2010 год
13.1.5.12 2011 год
13.1.6 период с 2012 по 2022 гг.
13.1.6.01 2012 год
13.1.6.02 2013 год
13.1.6.03 2014 год
13.1.6.04 2015 год
13.1.6.05 2016 год
13.1.6.06 2017 год
13.1.6.07 2018 год
13.1.6.08 2019 год
13.1.6.09 2020 год
13.1.6.10 2021 год
13.1.6.11 2022 год
13.2 Газета «Деловой мир»
13.3 Газета «Республика Башкортостан»
13.4 Газета «Геофизик Татарии»
13.5 Журналы
";
$elements = explode("\n", $catalog_string);
//var_dump($elements);
$page = '<html><head></head><body>';

try {
	$connection = new PDO('mysql:host=127.0.0.1;port=3306;dbname=c9;charset=UTF8', 'killercrush', '');
	$connection->setAttribute(PDO::ATTR_DEFAULT_FETCH_MODE, PDO::FETCH_ASSOC);
	$connection->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);

} catch (PDOException $e) {
	print "Error!: " . $e->getMessage() . "<br/>";
	die();
}



$query = $connection->prepare('INSERT INTO `categories`(id, parent_id, name) VALUES (:id, :parent_id, :name)');		
foreach($elements as $key => $value) {

    $id = array();
    preg_match('/\.[0-9]+ |^[0-9]+ /', $value, $id);
    if (!isset($id[0])) {
        continue;
        $id = 'NULL';
        $parent_id = 'NULL';
    } else if(strpos($id[0], '.') !== false) {
        //$id = substr($id[0], 1);
        $parent_id = substr($value, 0, strpos($value, $id[0]));
        $id = substr($value, 0, strpos($value, $id[0]) + strlen($id[0]));
        
    } else {
        $id = $id[0];
        $parent_id = 'NULL';
    }
    
//     $parent_id = array();
//     preg_match_all('/[0-9]+\./', $value, $parent_id, PREG_SET_ORDER);
// 	if(!isset($parent_id[0])) {
// 	    $parent_id = 'NULL';
// 	} else {
// 	    $parent_id = end($parent_id)[0];
// 	}    
    $name = substr($value, strpos($value, $id) + strlen($id));
    
 	$query->bindValue(':id', $id);
 	$query->bindValue(':parent_id', $parent_id);
	$query->bindValue(':name', $name);

	if ($query->execute()) {

	    $page .= $key . ') ' . $value . ' id=' . $id 
	        . ' parent_id=' . $parent_id . ' name='. $name . '<hr>';
	}
}
$page .= '</body>';
echo $page;
?>